renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type3/aws_ota_pal.c
#define ONE_COMMAND_BINARY_LENGH 16
#define HASH_SHA1_LENGTH 20

#define otaconfigMAX_NUM_BLOCKS_REQUEST        	128U	/* this value will be appeared after 201908.00 in aws_ota_agent_config.h */

typedef struct _load_firmware_control_block {
	uint32_t status;
	uint8_t *flash_buffer_for_erase_unit;
	uint8_t *flash_buffer_program_unit;
	uint32_t processed_byte;
	volatile uint32_t flash_write_in_progress_flag;
	volatile uint32_t flash_erase_in_progress_flag;
	uint32_t progress;
	uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
	OTA_ImageState_t eSavedAgentState;
	OTA_FileContext_t OTA_FileContext;
}LOAD_FIRMWARE_CONTROL_BLOCK;

typedef struct _firmware_update_control_block_sub
{
	uint32_t user_program_max_cnt;
	uint32_t lifecycle_state;
	uint8_t hash0_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
	uint8_t hash1_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
}FIRMWARE_UPDATE_CONTROL_BLOCK_SUB;

typedef struct _firmware_update_control_block
{
	FIRMWARE_UPDATE_CONTROL_BLOCK_SUB data;
	uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
}FIRMWARE_UPDATE_CONTROL_BLOCK;

typedef struct _fragmented_packet
{
	uint32_t packet_number;
	uint8_t type;	/* 0: head, 1: tail */
	uint8_t	*string;
	uint8_t length;
}FRAGMENTED_PACKET;

typedef struct _fragmented_packet_list
{
	FRAGMENTED_PACKET content;
	struct _fragmented_packet_list *next;
}FRAGMENTED_PACKET_LIST;

typedef struct _flash_block
{
	uint32_t address;
	uint8_t	*binary;
	uint8_t length;
}FLASH_BLOCK;

typedef struct _fragmented_flash_block_list
{
	FLASH_BLOCK content;
	struct _fragmented_flash_block_list *next;
}FRAGMENTED_FLASH_BLOCK_LIST;

static LOAD_FIRMWARE_CONTROL_BLOCK load_firmware_control_block;
static FRAGMENTED_PACKET_LIST *fragmented_packet_list_head;
static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_head;
static QueueHandle_t xQueue;

static void bank_swap(void);
static uint32_t *flash_copy_vector_table(void);
static void dummy_int(void);
static void ota_flashing_task(void);

static FRAGMENTED_PACKET_LIST *fragmented_packet_list_add(FRAGMENTED_PACKET_LIST *head, uint32_t packet_number, uint8_t type, uint8_t *string, uint8_t length);
static FRAGMENTED_PACKET_LIST *fragmented_packet_list_delete(FRAGMENTED_PACKET_LIST *head, uint32_t packet_number, uint8_t type);
static FRAGMENTED_PACKET_LIST *fragmented_packet_list_search(FRAGMENTED_PACKET_LIST *head, uint32_t packet_number, uint8_t type);
static FRAGMENTED_PACKET_LIST *fragmented_packet_list_print(FRAGMENTED_PACKET_LIST *head);

static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_insert(FRAGMENTED_FLASH_BLOCK_LIST *head, uint32_t address, uint8_t *binary, uint8_t length);
static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_delete(FRAGMENTED_FLASH_BLOCK_LIST *head, uint32_t address);
static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_print(FRAGMENTED_FLASH_BLOCK_LIST *head);
static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_assemble(FRAGMENTED_FLASH_BLOCK_LIST *head, FLASH_BLOCK *flash_block);


/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_CreateFileForRx( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CreateFileForRx" );
    OTA_LOG_L1("[%s] is called.\r\n", OTA_METHOD_NAME);
    OTA_LOG_L1("Compiled in [%s] [%s].\r\n", __DATE__, __TIME__);
    OTA_Err_t eResult = kOTA_Err_Uninitialized;
    static uint8_t *dummy_file_pointer;
    static uint8_t dummy_file;
    dummy_file_pointer = &dummy_file;

    uint8_t *test = 0;
    for(int i = 0; i < 256; i++)
    {
    	test[i] = 0x55;
    }


    if( C != NULL )
    {
        if( C->pucFilePath != NULL )
        {
        	if((load_firmware_control_block.status != FIRMWARE_UPDATE_STATE_CLOSED)
        			|| (load_firmware_control_block.status != FIRMWARE_UPDATE_STATE_FINALIZE_COMPLETED)
        			|| (load_firmware_control_block.status != FIRMWARE_UPDATE_STATE_COMPLETED)
        			|| (load_firmware_control_block.status != FIRMWARE_UPDATE_STATE_ERROR))
        	{
				memset(&load_firmware_control_block, 0, sizeof(LOAD_FIRMWARE_CONTROL_BLOCK));
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_INITIALIZED;
				load_firmware_control_block.eSavedAgentState = eOTA_ImageState_Unknown;
				memcpy(&load_firmware_control_block.OTA_FileContext, C, sizeof(OTA_FileContext_t));
				C->pucFile = dummy_file_pointer;
				fragmented_packet_list_head = NULL;
				fragmented_flash_block_list_head = NULL;

				/* create task/queue for flashing */
				xTaskCreate(ota_flashing_task, "OTA_FLASHING_TASK", configMINIMAL_STACK_SIZE, NULL, tskIDLE_PRIORITY, NULL);
				xQueue = xQueueCreate(otaconfigMAX_NUM_BLOCKS_REQUEST, sizeof(FLASH_BLOCK));

				eResult = kOTA_Err_None;
				OTA_LOG_L1( "[%s] Receive file created.\r\n", OTA_METHOD_NAME );
        	}
        	else
        	{
                eResult = kOTA_Err_RxFileCreateFailed;
                OTA_LOG_L1( "[%s] ERROR - now in progress.\r\n", OTA_METHOD_NAME );
        	}
        }
        else
        {
            eResult = kOTA_Err_RxFileCreateFailed;
            OTA_LOG_L1( "[%s] ERROR - Invalid context provided.\r\n", OTA_METHOD_NAME );
        }
    }
    else
    {
        eResult = kOTA_Err_RxFileCreateFailed;
        OTA_LOG_L1( "[%s] ERROR - Invalid context provided.\r\n", OTA_METHOD_NAME );
    }

    return eResult;
}

/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_Abort( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_Abort" );
    OTA_LOG_L1("[%s] is called.\r\n", OTA_METHOD_NAME);

    /* Set default return status to uninitialized. */
    OTA_Err_t eResult = kOTA_Err_Uninitialized;

    if( NULL != C )
    {
		memset(&load_firmware_control_block, 0, sizeof(LOAD_FIRMWARE_CONTROL_BLOCK));
		load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
        OTA_LOG_L1( "[%s] OK\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_None;
    }
    else /* Context was not valid. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid context.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_FileAbort;
    }
    return eResult;
}
/*-----------------------------------------------------------*/

