renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type3/aws_ota_pal.c
/***********************************************************************************************************************
* Function Name: flash_copy_vector_table
* Description  : Moves the relocatable vector table to RAM. This is only needed if ROM operations are performed.
*                ROM cannot be accessed during operations. The vector table is located in ROM and will be accessed
*                if an interrupt occurs.
* Arguments    : none
* Return Value : uint32_t *flash_vect
***********************************************************************************************************************/
static uint32_t *flash_copy_vector_table(void)
{
    uint32_t *flash_vect;
    uint32_t   i;
    static uint32_t g_ram_vector_table[256];      // RAM space to hold the vector table

    /* Get address of variable vector table in ROM */
    flash_vect = (uint32_t *)get_intb();

    /* Copy over variable vector table to RAM */
    for(i = 0; i < 256; i++ )
    {
    	g_ram_vector_table[i] = (uint32_t)dummy_int;      // Copy over entry
    }

    g_ram_vector_table[VECT_FCU_FIFERR] = flash_vect[VECT_FCU_FIFERR];
    g_ram_vector_table[VECT_FCU_FRDYI] = flash_vect[VECT_FCU_FRDYI];

    /* Set INTB to ram address */
#if __RENESAS_VERSION__ >= 0x01010000
    set_intb((void *)&g_ram_vector_table[0] );
#else
    set_intb( (uint32_t)&g_ram_vector_table[0] );
#endif
    return flash_vect;
}

#pragma section FRAM2
#pragma interrupt (dummy_int)
static void dummy_int(void)
{
	/* nothing to do */
}
#pragma section

/***********************************************************************************************************************
* Function Name: fragmented_packet_list_add
* Description  : Add the fragmented packet into the list
* Arguments    : head - current head of list
*                packet_number - packet number of block
*                type - fragment direction
*                string - character string
*                length - string length
* Return Value : FRAGMENTED_PACKET_LIST* - new head of list (returns same value as specified head in normally,
*                                                            new head would be returned when head would be specified as NULL.)
***********************************************************************************************************************/
static FRAGMENTED_PACKET_LIST *fragmented_packet_list_add(FRAGMENTED_PACKET_LIST *head, uint32_t packet_number, uint8_t type, uint8_t *string, uint8_t length)
{
	FRAGMENTED_PACKET_LIST *tmp, *new;

    new = pvPortMalloc(sizeof(FRAGMENTED_PACKET_LIST));
    new->content.string = pvPortMalloc(length + 1); /* +1 means string terminator 0 */
    new->content.string[0] = 0;
    new->content.string[length] = 0;

    if((new != NULL) && (new->content.string != NULL))
    {
        strcpy((char *)new->content.string, (char *)string);
    	new->content.packet_number = packet_number;
    	new->content.type = type;
    	new->content.length = length;
    	new->next = NULL;

    	/* new head would be returned when head would be specified as NULL. */
    	if(head == NULL)
    	{
    		tmp = new;
    	}
    	else
    	{
        	/* store the allocated memory "new" into "tail of list" */
	    	tmp = head;
			while(tmp->next != NULL)
			{
				tmp = tmp->next;
			}
	    	tmp->next = new;

	    	/* returns same value as specified head in normally */
	    	tmp = head;
    	}
    }
    else
    {
    	tmp = NULL;
    	/* todo: リスト全消去 */
    }
    return tmp;
}

/***********************************************************************************************************************
* Function Name: fragmented_packet_list_delete
* Description  : Delete the fragmented packet into the list
* Arguments    : head - current head of list
*                packet_number - packet number of block
*                type - fragment direction
*
* Return Value : FRAGMENTED_PACKET_LIST* - new head of list (returns same value as specified head in normally,
*                                                            new head would be returned when head would be deleted.
*                                                            NULL would be returned when all list are deleted.)
***********************************************************************************************************************/
static FRAGMENTED_PACKET_LIST *fragmented_packet_list_delete(FRAGMENTED_PACKET_LIST *head, uint32_t packet_number, uint8_t type)
{
	FRAGMENTED_PACKET_LIST *tmp = head, *previous = NULL;

	if(head != NULL)
	{
		while(1)
		{
			if((tmp->content.packet_number == packet_number) && (tmp->content.type == type))
			{
				break;
			}
			if(tmp->next == NULL)
			{
				tmp = NULL;
				break;
			}
			previous = tmp;
			tmp = tmp->next;
		}
		if(tmp != NULL)
		{
			/* delete target exists on not head, remove specified and return head in this case */
			if(previous != NULL)
			{
				previous->next = tmp->next;
				vPortFree(tmp->content.string);
				vPortFree(tmp);
				tmp = head;
			}
			else
			{
				/* delete target exists on head with subsequent data, remove head and return specified (as new head) in this case */
				if(head->next != NULL)
				{
					tmp = head->next;
				}
				/* delete target exists on head without subsequent data, remove head and return NULL in this case */
				else
				{
					tmp = NULL;
				}
				vPortFree(head->content.string);
				vPortFree(head);
			}
		}
	}
	return tmp;
}

static FRAGMENTED_PACKET_LIST *fragmented_packet_list_search(FRAGMENTED_PACKET_LIST *head, uint32_t packet_number, uint8_t type)
{
	FRAGMENTED_PACKET_LIST *tmp = head;

	while(1)
	{
		if((tmp->content.packet_number == packet_number) && (tmp->content.type == type))
		{
			break;
		}
		if(tmp->next == NULL)
		{
			tmp = NULL;
			break;
		}
		tmp = tmp->next;
	}
	return tmp;
}

static FRAGMENTED_PACKET_LIST *fragmented_packet_list_print(FRAGMENTED_PACKET_LIST *head)
{
	FRAGMENTED_PACKET_LIST *tmp = head;
	uint32_t total_heap_length, total_list_count;

	total_heap_length = 0;
	total_list_count = 0;

