renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type3/aws_ota_pal.c
	if(head != NULL)
	{
		while(1){
			total_heap_length += sizeof(FRAGMENTED_PACKET_LIST);
			total_heap_length += tmp->content.length;
			total_list_count++;
			if(tmp->next == NULL)
			{
				break;
			}
			tmp = tmp->next;
		};
	}
    OTA_LOG_L2("FRAGMENTED_PACKET_LIST: total_heap_length = [%d], total_list_count = [%d].\r\n", total_heap_length, total_list_count);

	return tmp;
}

/***********************************************************************************************************************
* Function Name: fragmented_flash_block_list_insert
* Description  : Add the fragmented packet into the list
* Arguments    : head - current head of list
*                block_number - packet number of block
*                type - fragment direction
*                binary - binary array
*                length - binary length
* Return Value : FRAGMENTED_PACKET_LIST* - new head of list (returns same value as specified head in normally,
*                                                            new head would be returned when head would be specified as NULL.)
***********************************************************************************************************************/
static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_insert(FRAGMENTED_FLASH_BLOCK_LIST *head, uint32_t address, uint8_t *binary, uint8_t length)
{
	FRAGMENTED_FLASH_BLOCK_LIST *tmp, *current, *previous, *new;
	static FRAGMENTED_FLASH_BLOCK_LIST *tail;

    new = pvPortMalloc(sizeof(FRAGMENTED_PACKET_LIST));
    new->content.binary = pvPortMalloc(length);

    if((new != NULL) && (new->content.binary != NULL))
    {
        memcpy(new->content.binary, binary, length);
    	new->content.address = address;
    	new->content.length = length;
    	new->next = NULL;

    	/* new head would be returned when head would be specified as NULL. */
    	if(head == NULL)
    	{
    		tmp = new;
    		tail = new;
    	}
    	else
    	{
    		if(new->content.address > tail->content.address)
    		{
    			tail->next = new;
    			tail = new;
    			tmp = head;
    		}
    		else
    		{
				/* search the list to insert new node */
				current = head;
				while(1)
				{
					if((new->content.address < current->content.address) || (current == NULL))
					{
						break;
					}
					previous = current;
					current = current->next;
				}
				/* insert the searched node when current != head */
				if(current != head)
				{
					previous->next = new;
					new->next = current;
					tmp = head;
				}
				else
				{
					new->next = current;
					tmp = new;
				}
    		}
    	}
    }
    else
    {
    	tmp = NULL;
    	/* todo: リスト全消去 */
    }
    return tmp;
}

/***********************************************************************************************************************
* Function Name: fragmented_flash_block_delete
* Description  : Delete the fragmented packet into the list
* Arguments    : head - current head of list
*                block_number - packet number of block
*                type - fragment direction
*
* Return Value : FRAGMENTED_PACKET_LIST* - new head of list (returns same value as specified head in normally,
*                                                            new head would be returned when head would be deleted.
*                                                            NULL would be returned when all list are deleted.)
***********************************************************************************************************************/
static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_delete(FRAGMENTED_FLASH_BLOCK_LIST *head, uint32_t address)
{
	FRAGMENTED_FLASH_BLOCK_LIST *tmp = head, *previous = NULL;

	if(head != NULL)
	{
		while(1)
		{
			if(tmp->content.address == address)
			{
				break;
			}
			if(tmp->next == NULL)
			{
				tmp = NULL;
				break;
			}
			previous = tmp;
			tmp = tmp->next;
		}
		if(tmp != NULL)
		{
			/* delete target exists on not head, remove specified and return head in this case */
			if(previous != NULL)
			{
				previous->next = tmp->next;
				vPortFree(tmp->content.binary);
				vPortFree(tmp);
				tmp = head;
			}
			else
			{
				/* delete target exists on head with subsequent data, remove head and return specified (as new head) in this case */
				if(head->next != NULL)
				{
					tmp = head->next;
				}
				/* delete target exists on head without subsequent data, remove head and return NULL in this case */
				else
				{
					tmp = NULL;
				}
				vPortFree(head->content.binary);
				vPortFree(head);
			}
		}
	}
	return tmp;
}

static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_print(FRAGMENTED_FLASH_BLOCK_LIST *head)
{
	FRAGMENTED_FLASH_BLOCK_LIST *tmp = head;
	uint32_t total_heap_length, total_list_count;

	total_heap_length = 0;
	total_list_count = 0;

	if(head != NULL)
	{
		while(1){
			total_heap_length += sizeof(FRAGMENTED_FLASH_BLOCK_LIST);
			total_heap_length += tmp->content.length;
			total_list_count++;
			if(tmp->next == NULL)
			{
				break;
			}
			tmp = tmp->next;
		};
	}
    OTA_LOG_L2("FRAGMENTED_FLASH_BLOCK_LIST: total_heap_length = [%d], total_list_count = [%d].\r\n", total_heap_length, total_list_count);

	return tmp;
}

/***********************************************************************************************************************
* Function Name: fragmented_flash_block_list_assemble
* Description  : Assemble the fragmented flash block from the list
* Arguments    : head - current head of list
*                flash_block
*                  address - top of actual physical address of the flash_block, if this value would be NULL, no target flash data exists.
*                  binary - assembled flash_block[FLASH_CF_MIN_PGM_SIZE] from the list
*                  length - binary length
* Return Value : FRAGMENTED_PACKET_LIST* - new head of list (returns same value as specified head in normally,
*                                                            new head would be returned when head would be deleted.
*                                                            NULL would be returned when all list are deleted.)
***********************************************************************************************************************/
static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_assemble(FRAGMENTED_FLASH_BLOCK_LIST *head, FLASH_BLOCK *flash_block)
{
	FRAGMENTED_FLASH_BLOCK_LIST *tmp = head;
	FRAGMENTED_FLASH_BLOCK_LIST *flash_block_candidate[FLASH_CF_MIN_PGM_SIZE/ONE_COMMAND_BINARY_LENGH];
	uint32_t assembled_length = 0;
	uint32_t loop_counter;

	/* search aligned FLASH_CF_MIN_PGM_SIZE top address */
	while(1)
	{
		if(!(tmp->content.address % FLASH_CF_MIN_PGM_SIZE))
		{
			/* find out flash_block candidate */
			assembled_length = 0;
			loop_counter = 0;
			for(uint32_t i = 0; i < (FLASH_CF_MIN_PGM_SIZE / ONE_COMMAND_BINARY_LENGH); i++)
			{
				if(tmp->content.address + tmp->content.length == tmp->next->content.address)
				{
					assembled_length += tmp->content.length;
					flash_block_candidate[loop_counter++] = tmp;
					tmp = tmp->next;
				}
				else if(loop_counter == ((FLASH_CF_MIN_PGM_SIZE / ONE_COMMAND_BINARY_LENGH) - 1))
				{
					if((assembled_length + tmp->next->content.length) == FLASH_CF_MIN_PGM_SIZE)
					{
						assembled_length += tmp->next->content.length;
						flash_block_candidate[loop_counter++] = tmp;
						tmp = tmp->next;
						break;
					}
				}
				else
				{
					tmp = tmp->next;
					break;
				}
			}
		}
		else
		{
			tmp = tmp->next;
		}
		if((assembled_length == FLASH_CF_MIN_PGM_SIZE) || (tmp->next == NULL))
		{
			break;
		}
	}

	tmp = head;
	flash_block->address = NULL;
	/* remove flash_block from list */
	if(assembled_length == FLASH_CF_MIN_PGM_SIZE)
	{
		flash_block->address = flash_block_candidate[0]->content.address;
		for(uint32_t i = 0; i < (FLASH_CF_MIN_PGM_SIZE/ONE_COMMAND_BINARY_LENGH); i++)
		{
			memcpy(&flash_block->binary[i * ONE_COMMAND_BINARY_LENGH], tmp->content.binary, tmp->content.length);
			tmp = fragmented_flash_block_list_delete(tmp, flash_block_candidate[i]->content.address);
		}
		flash_block->length = assembled_length;
	}
	return tmp;

}

static void ota_flashing_task(void)
{
	FLASH_BLOCK *flash_block;
	while(1)
	{
		xQueueReceive(xQueue, flash_block, portMAX_DELAY);
	}
}
